In [1]:
import geopandas as gpd
import pandas as pd

In [2]:
wrecks_df = pd.read_excel("data/shipwrecks.xlsx").rename(columns={"LAT":"lat", "LONG":"lon", "DATE": "date"})
wrecks_df

                      date        lat        lon
0      1996-05-13 05:50:00  40.876665 -91.031665
1      1996-05-13 05:50:01  40.876665 -91.031665
2      1996-05-13 05:50:01  40.876665 -91.031665
3      1996-05-13 05:50:02  40.876665 -91.031665
4      1996-05-13 05:50:02  40.876665 -91.031665
...                    ...        ...        ...
106261 2015-06-22 14:10:01  37.310490 -89.513615
106262 2015-06-22 16:35:00  25.760800 -79.956670
106263 2015-06-22 16:35:00  25.760800 -79.956670
106264 2015-06-24 13:52:00  29.732314 -95.127879
106265 2015-06-24 13:53:00  29.732314 -95.127879

[106266 rows x 3 columns]

In [3]:
wrecks_gdf = gpd.GeoDataFrame(
    wrecks_df,
    geometry=gpd.points_from_xy(wrecks_df.lon, wrecks_df.lat),
    crs="EPSG:4326"
).to_crs("EPSG:3857")
wrecks_gdf

,date,lat,lon,geometry
0,1996-05-13 05:50:00,40.876665,-91.031665,POINT (-10133598.594 4994166.765)
1,1996-05-13 05:50:01,40.876665,-91.031665,POINT (-10133598.594 4994166.765)
2,1996-05-13 05:50:01,40.876665,-91.031665,POINT (-10133598.594 4994166.765)
3,1996-05-13 05:50:02,40.876665,-91.031665,POINT (-10133598.594 4994166.765)
4,1996-05-13 05:50:02,40.876665,-91.031665,POINT (-10133598.594 4994166.765)
...,...,...,...,...
106261,2015-06-22 14:10:01,37.310490,-89.513615,POINT (-9964610.041 4482473.908)
106262,2015-06-22 16:35:00,25.760800,-79.956670,POINT (-8900735.79 2969485.035)
106263,2015-06-22 16:35:00,25.760800,-79.956670,POINT (-8900735.79 2969485.035)
106264,2015-06-24 13:52:00,29.732314,-95.127879,POINT (-10589587.051 3469187.503)
106265,2015-06-24 13:53:00,29.732314,-95.127879,POINT (-10589587.051 3469187.503)

In [4]:
countries = gpd.read_file("data/natural_earth/ne_10m_admin_0_countries/ne_10m_admin_0_countries.shp").to_crs("EPSG:3857")
wrecks_with_country = gpd.sjoin_nearest(wrecks_gdf, countries, how="left").rename(columns={"NAME":"near"})[["date", "lat", "lon", "near"]]
wrecks_with_country

                      date        lat        lon                      near
0      1996-05-13 05:50:00  40.876665 -91.031665  United States of America
1      1996-05-13 05:50:01  40.876665 -91.031665  United States of America
2      1996-05-13 05:50:01  40.876665 -91.031665  United States of America
3      1996-05-13 05:50:02  40.876665 -91.031665  United States of America
4      1996-05-13 05:50:02  40.876665 -91.031665  United States of America
...                    ...        ...        ...                       ...
106261 2015-06-22 14:10:01  37.310490 -89.513615  United States of America
106262 2015-06-22 16:35:00  25.760800 -79.956670  United States of America
106263 2015-06-22 16:35:00  25.760800 -79.956670  United States of America
106264 2015-06-24 13:52:00  29.732314 -95.127879  United States of America
106265 2015-06-24 13:53:00  29.732314 -95.127879  United States of America

[106266 rows x 4 columns]

In [7]:
print(wrecks_with_country["near"].value_counts()[:60])

near
United States of America    100464
Canada                         860
Ghana                          623
Puerto Rico                    528
U.S. Virgin Is.                373
Mexico                         305
China                          304
Guam                           297
Chile                          129
Japan                          128
N. Mariana Is.                 109
Bahamas                        107
Portugal                       103
India                          103
Russia                          92
American Samoa                  69
Brazil                          67
U.S. Minor Outlying Is.         66
Panama                          65
Pitcairn Is.                    58
United Arab Emirates            56
Cuba                            56
Egypt                           53
Kuwait                          51
Nigeria                         45
Bermuda                         44
South Korea                     39
Spain                           37
Germany                         33
Kyrgyzstan                      31
Greenland                       30
Br. Indian Ocean Ter.           30
Italy                           29
Oman                            28
United Kingdom                  26
Indonesia                       26
Micronesia                      26
Dominican Rep.                  26
Angola                          24
Yemen                           22
Iran                            22
Pakistan                        21
Kazakhstan                      20
Djibouti                        18
Greece                          18
Kiribati                        18
Singapore                       18
Saudi Arabia                    17
Turks and Caicos Is.            17
Colombia                        16
Philippines                     16
Nepal                           15
Marshall Is.                    14
British Virgin Is.              14
France                          14
Eq. Guinea                      13
Qatar                           13
Netherlands                     13
Bahrain                         13
Cayman Is.                      12
Name: count, dtype: int64

In [6]:
wrecks_with_country.to_excel("data/shipwrecks_with_country.xlsx", index=False)